/*****************************************************************
 * Copyright(c) 2012, 武汉中原电子集团 应用电子研发中心
 * All rights reserved.
 * *
 * 文件名称:
 *
 * 摘要:
 *
 * 作者:PengPeng <yougukepp@gmail.com>
 *
 * 完成日期:
 *****************************************************************/
/*--------------------------- 预处理区 --------------------------*/
#ifndef __G_TYPEDEF__H__
#define __G_TYPEDEF__H__

/***************************** 头文件 ****************************/
#include        "assert.h"
#include        "stdlib.h"
#include        "math.h"
#include        "fcntl.h"
#include        <GLES2/gl2.h>
#include        <EGL/egl.h> 
#include        <string>
#include        <iostream>
#include        <fstream>
#include        <vector>
using namespace std;


/***************************** 宏定义 ****************************/

/**************************** 类型定义 ***************************/
typedef void (* GCallBackFuncPtr)(void);

/*-------------------------- 接口声明区 -------------------------*/

/**************************** 全局变量 ***************************/


/**************************** 接口函数 ***************************/


#endif

