/*****************************************************************
 * Copyright(c) 2012, 武汉中原电子集团 应用电子研发中心
 * All rights reserved.
 * *
 * 文件名称:
 *
 * 摘要:
 *
 * 作者:PengPeng <yougukepp@gmail.com>
 *
 * 完成日期:
 *****************************************************************/
/*--------------------------- 预处理区 --------------------------*/
#ifndef __G_EGL_H__
#define __G_EGL_H__

/***************************** 头文件 ****************************/
#include "../GTypedef.h"


/***************************** 宏定义 ****************************/


/**************************** 类型定义 ***************************/
class GEgl{
public:
    enum Type{
        fb,
        x11,
    }; 
    GEgl(void);
    void Swap(void);

private:
    EGLDisplay egldisplay;
    EGLSurface eglsurface;

#ifdef EGL_USE_X11
    Display *display;
#endif

};





/*-------------------------- 接口声明区 -------------------------*/

/**************************** 全局变量 ***************************/


/**************************** 接口函数 ***************************/

#endif


